Revit 2027 API
BarTerminationsData.TerminationOrientationAtStart Property
Identifies the orientation of the termination's (e.g. hook, crank) plane at the start of the bar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The termination is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
Value = Left: The termination is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
The default value is Left.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarTerminationOrientation TerminationOrientationAtStart { get; set; }
Public Property TerminationOrientationAtStart As RebarTerminationOrientation
	Get
	Set
public:
property RebarTerminationOrientation TerminationOrientationAtStart {
	RebarTerminationOrientation get ();
	void set (RebarTerminationOrientation value);
}
member TerminationOrientationAtStart : RebarTerminationOrientation with get, set
Property Value
RebarTerminationOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BarTerminationsData Class
Autodesk.Revit.DB.Structure Namespace